In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df=sns.load_dataset('iris')

In [3]:
# head(): This function is used to display the first few rows of a DataFrame.
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [4]:
#groupby(): This function is used to group data in a DataFrame based on one or more columns, and then perform some operation on the groups.
grouped=df.groupby('species')['sepal_length'].mean()
print(grouped)

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [5]:
#info(): This function is used to display a summary of the DataFrame, including the column names, data types, and number of non-null values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [6]:
#describe(): This function is used to generate descriptive statistics of the DataFrame, including count, mean, standard deviation, and percentiles.
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [7]:
#drop(): This function is used to drop rows or columns from the DataFrame.
df.drop('sepal_length',axis=1)

     sepal_width  petal_length  petal_width    species
0            3.5           1.4          0.2     setosa
1            3.0           1.4          0.2     setosa
2            3.2           1.3          0.2     setosa
3            3.1           1.5          0.2     setosa
4            3.6           1.4          0.2     setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  virginica
146          2.5           5.0          1.9  virginica
147          3.0           5.2          2.0  virginica
148          3.4           5.4          2.3  virginica
149          3.0           5.1          1.8  virginica

[150 rows x 4 columns]

In [8]:
#Q2
def reindexing(df):
    new=[(2*i-1) for i in range(1,len(df)+1)]
    df.index=new
    return df

In [9]:
#Q3
import pandas as pd
def sum_first_three_values(df):
    sum_values = 0
    # Iterate over the first three rows of the 'Values' column
    for value in df['Values'].head(3):
        # Add the value to the sum
        sum_values += value
    return sum_values
# Create a sample DataFrame
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

# Call the function to calculate the sum of the first three
print(sum_first_three_values(df))

60

In [10]:
#Q4
import pandas as pd
df = pd.DataFrame({'Text': ['This is a sentence.', 'Another sentence here.', 'And a third sentence.']})
def word_count(df):
    df['Word_Count']=df['Text'].apply(lambda x: len(x.split()))
    return df

word_count(df)

                     Text  Word_Count
0     This is a sentence.           4
1  Another sentence here.           3
2   And a third sentence.           4

In [11]:
#Q5
'''Datframe.size returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. 
For example, if you have a DataFrame with 3 rows and 4 columns, the size method would return 12.'''

'''DataFrame.shape returns a tuple containing the number of rows and the number of columns in the DataFrame, respectively.
For example, if you have a DataFrame with 3 rows and 4 columns, the shape method would return (3, 4)'''

'DataFrame.shape returns a tuple containing the number of rows and the number of columns in the DataFrame, respectively.\nFor example, if you have a DataFrame with 3 rows and 4 columns, the shape method would return (3, 4)'

In [ ]:
#Q6
pd.read_excel()

In [17]:
#Q7
import pandas as pd

def extract_username(df):
    # extract username from email using string split function
    df['Username'] = df['Email'].str.split('@').str[0]
    return df
#OR

def extract_username1(df):
    # Create a new column 'Username' and extract the username part from 'Email'
    df['Username'] = df['Email'].apply(lambda email: email.split('@')[0])
    
    return df



# Create a sample DataFrame with an 'Email' column
data = {'Email': ['john@example.com', 'amit@example.com', 'abhaysamal@example.com']}
df = pd.DataFrame(data)

# Use the extract_username() function to extract the usernames and store them in a new 'Username' column
df = extract_username(df)
df2=extract_username1(df)
# Print the resulting DataFrame
print(df,"\n")
print(df2)

                    Email    Username
0        john@example.com        john
1        amit@example.com        amit
2  abhaysamal@example.com  abhaysamal

                    Email    Username
0        john@example.com        john
1        amit@example.com        amit
2  abhaysamal@example.com  abhaysamal

In [34]:
#Q8
import pandas as pd

# Create a dictionary with the data
data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)

def mod_df(df):
    df1 = df[(df["A"] > 5) & (df["B"] < 10)]
    return df1
mod_df(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [35]:
#Q9
import pandas as pd

def calculate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    return (mean, median, std_dev)

In [36]:
#Q10
import pandas as pd

def calculate_moving_average(df):
    # Sort the DataFrame by date
    df = df.sort_values(by='Date')
    
    # Calculate the moving average with a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

In [38]:
#Q11
import pandas as pd

def add_weekday_column(df):
    # Convert the 'Date' column to a Pandas datetime object
    df['Date'] = pd.to_datetime(df['Date'])

    # Extract the weekday name from the datetime object and assign it to a new column 'Weekday'
    df['Weekday'] = df['Date'].dt.day_name()

    return df
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}

df = pd.DataFrame(data)
add_weekday_column(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [60]:
#Q12
import pandas as pd
data = {'Date': ['2022-01-01 12:00:00', '2023-01-02 08:00:00', '2023-01-03 14:00:00',
                 '2023-01-04 19:00:00', '2023-01-05 06:00:00', '2023-02-01 10:00:00'],
        'Values': [5, 2, 8, 3, 7, 9]}

df = pd.DataFrame(data)
def select_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    return df.loc[mask]


result_df = select_dates(df)
result_df

                  Date  Values
1  2023-01-02 08:00:00       2
2  2023-01-03 14:00:00       8
3  2023-01-04 19:00:00       3
4  2023-01-05 06:00:00       7

In [ ]:
#Q13
The first and foremost necessary library that needs to be imported to use the basic functions of Pandas is the pandas library itself.